&НаКлиенте
Функция РаспределитьПоЭффективномуОстатку(РаспределяемаяСумма, Коэффициенты, Точность)
	ОстатокРаспределения = РаспределяемаяСумма;
	ЭффективнаяТочность = Pow(10, Точность);
	КоэффициентыАбсолютные = Новый Массив(Новый ФиксированныйМассив(Коэффициенты));
	Результат = Новый Массив(КоэффициентыАбсолютные.Количество());
	ЭффективныйИтог = 0;
	Для Индекс = 0 По Результат.ВГраница() Цикл
		ЭффективныйИтог = ЭффективныйИтог + КоэффициентыАбсолютные[Индекс];
	КонецЦикла;
	Коэффициент = ОстатокРаспределения / ЭффективныйИтог;
	Для Индекс = 0 По Результат.ВГраница() Цикл
		СуммаРаспределения = Мин(ОстатокРаспределения, Окр(Коэффициент * КоэффициентыАбсолютные[Индекс], Точность));
		Результат[Индекс] = СуммаРаспределения;
		ОстатокРаспределения = ОстатокРаспределения - СуммаРаспределения;
	КонецЦикла;
	Если ОстатокРаспределения = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	ЭффективныеКоэффициенты = РаботаСМассивом.Отобразить(КоэффициентыАбсолютные, "Новый Структура('Индекс, Значение', Индекс, Элемент)");
	РаботаСМассивом.Сортировать(ЭффективныеКоэффициенты, "Сравнить(Б.Значение, А.Значение)");
	Пока ОстатокРаспределения <> 0 Цикл
		ЭффективнаяПорция = Мин(КоэффициентыАбсолютные.Количество(), ОстатокРаспределения * ЭффективнаяТочность);
		ЭффективныйИтог = 0;
		Для Индекс = 0 По ЭффективнаяПорция - 1 Цикл
			ЭффективныйИтог = ЭффективныйИтог + ЭффективныеКоэффициенты[Индекс].Значение; 		
		КонецЦикла;
		Коэффициент = ОстатокРаспределения / ЭффективныйИтог;
		Для Индекс = 0 По ЭффективнаяПорция - 1 Цикл
			СуммаРаспределения = Мин(ОстатокРаспределения, Окр(Коэффициент * ЭффективныеКоэффициенты[Индекс].Значение, Точность));
			ИндексРезультата = ЭффективныеКоэффициенты[Индекс].Индекс;
			Результат[ИндексРезультата] = Результат[ИндексРезультата] + СуммаРаспределения;
			ОстатокРаспределения = ОстатокРаспределения - СуммаРаспределения;
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция РаспределитьСПересчетомБазыРаспределения(РаспределяемаяСумма, Коэффициенты, Точность)
	ОстатокРаспределения = РаспределяемаяСумма;
	ЭффективнаяТочность = Pow(10, Точность);
	КоэффициентыАбсолютные = Новый Массив(Новый ФиксированныйМассив(Коэффициенты));
	Результат = Новый Массив(КоэффициентыАбсолютные.Количество());
	ЭффективныйИтог = 0;
	Для Индекс = 0 По Результат.ВГраница() Цикл
		ЭффективныйИтог = ЭффективныйИтог + КоэффициентыАбсолютные[Индекс];
	КонецЦикла;
	Для Индекс = 0 По Результат.ВГраница() Цикл
		Коэффициент = ОстатокРаспределения / ЭффективныйИтог;
		СуммаРаспределения = Мин(ОстатокРаспределения, Окр(Коэффициент * КоэффициентыАбсолютные[Индекс], Точность));
		Результат[Индекс] = СуммаРаспределения;
		ОстатокРаспределения = ОстатокРаспределения - СуммаРаспределения;
		ЭффективныйИтог = ЭффективныйИтог - КоэффициентыАбсолютные[Индекс];
	КонецЦикла;
	Если ОстатокРаспределения = 0 Тогда
		Возврат Результат;
	КонецЕсли;
	ЭффективныеКоэффициенты = РаботаСМассивом.Отобразить(КоэффициентыАбсолютные, "Новый Структура('Индекс, Значение', Индекс, Элемент)");
	РаботаСМассивом.Сортировать(ЭффективныеКоэффициенты, "Сравнить(Б.Значение, А.Значение)");
	Пока ОстатокРаспределения <> 0 Цикл
		ЭффективнаяПорция = Мин(КоэффициентыАбсолютные.Количество(), ОстатокРаспределения * ЭффективнаяТочность);
		ЭффективныйИтог = 0;
		Для Индекс = 0 По ЭффективнаяПорция - 1 Цикл
			ЭффективныйИтог = ЭффективныйИтог + ЭффективныеКоэффициенты[Индекс].Значение; 		
		КонецЦикла;
		Коэффициент = ОстатокРаспределения / ЭффективныйИтог;
		Для Индекс = 0 По ЭффективнаяПорция - 1 Цикл
			СуммаРаспределения = Мин(ОстатокРаспределения, Окр(Коэффициент * ЭффективныеКоэффициенты[Индекс].Значение, Точность));
			ИндексРезультата = ЭффективныеКоэффициенты[Индекс].Индекс;
			Результат[ИндексРезультата] = Результат[ИндексРезультата] + СуммаРаспределения;
			ОстатокРаспределения = ОстатокРаспределения - СуммаРаспределения;
		КонецЦикла;
	КонецЦикла;
	Возврат Результат;
КонецФункции

&НаКлиенте
Функция МаксимальноеЗначениеВМассиве(Массив)
	
	МаксимальноеЗначение = 0;
	
	Для Индекс = 0 По Массив.Количество() - 1 Цикл
		Значение = Массив[Индекс];
		
		Если МаксимальноеЗначение < Значение Тогда
			МаксимальноеЗначение = Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат МаксимальноеЗначение;
	
КонецФункции

// Выполняет пропорциональное распределение суммы в соответствии
// с заданными коэффициентами распределения.
// Используется рекурсивный алгоритм с уменьшением базы. Погрешность распределяется по эффективной сумме
//
// Параметры:
//  РаспределяемаяСумма - Число  - сумма, которую надо распределить, если сумма равна 0 - то возвращается Неопределено;
//                                 Если передана отрицательная - расчет по модулю и после инверсия знаков результата.
//  Коэффициенты        - Массив - коэффициенты распределения, должны быть положительны или отрицательными одновременно
//  Точность            - Число  - точность округления при распределении. Необязателен.
//
// Возвращаемое значение:
//  Массив - массив размерностью равный массиву коэффициентов, содержит
//           суммы в соответствии с весом коэффициента (из массива коэффициентов).
//           В случае, если распределить невозможно (кол-во коэффициентов = 0
//           есть коэффициенты с отрицательным значением или суммарный вес коэффициентов = 0),
//           тогда будет возвращено Неопределено.
//
// Пример:
//
//	Коэффициенты = Новый Массив;
//	Коэффициенты.Добавить(1);
//	Коэффициенты.Добавить(2);
//	Результат = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(1, Коэффициенты);
//	// Результат = [0.33, 0.67]
//
&НаКлиенте
Функция РаспределитьСумму(Знач РаспределяемаяСумма, Знач Коэффициенты, Знач Точность = 2) Экспорт
	Если Коэффициенты.Количество() = 0 Тогда
		Возврат Неопределено;
	КонецЕсли;
	НужноИнвертироватьРезультат = Ложь;
	Если РаспределяемаяСумма < 0 Тогда
		РаспределяемаяСумма = -РаспределяемаяСумма;
		НужноИнвертироватьРезультат = Истина;
	КонецЕсли;
	КоэффициентыОтрицательны = (Коэффициенты[0] < 0);
	КоэффициентыРаспределения = Новый Массив(Новый ФиксированныйМассив(Коэффициенты)); // Копируем массив в памяти.
	СуммаКоэффициентов = 0;
	Для Индекс = 0 По КоэффициентыРаспределения.Количество() - 1 Цикл
		Коэффициент = КоэффициентыРаспределения[Индекс];
		Если КоэффициентыОтрицательны Тогда
			Если Коэффициент > 0 Тогда
				Возврат Неопределено;
			КонецЕсли;
		Иначе
			Если Коэффициент < 0 Тогда
				Возврат Неопределено;
			КонецЕсли;
		КонецЕсли;
		СуммаКоэффициентов = СуммаКоэффициентов + Коэффициент;
	КонецЦикла;
	
	Результат = Новый Массив(КоэффициентыРаспределения.Количество());
	
	ОстатокРаспределения = РаспределяемаяСумма;
	
	Для Индекс = 0 По КоэффициентыРаспределения.Количество() - 1 Цикл
		Коэффициент = КоэффициентыРаспределения[Индекс];
		СуммаРаспределения = Мин(ОстатокРаспределения, Окр(ОстатокРаспределения * Коэффициент / СуммаКоэффициентов, Точность, 1));
		Результат[Индекс] = СуммаРаспределения;
		СуммаКоэффициентов = СуммаКоэффициентов - Коэффициент;
		ОстатокРаспределения = ОстатокРаспределения - СуммаРаспределения;
	КонецЦикла;
	
	Если ОстатокРаспределения <> 0 Тогда
		ВызватьИсключение "Не удалось распределить сумму";
	КонецЕсли;
	
	Если НужноИнвертироватьРезультат Тогда
		Для Индекс = 0  По Результат.ВГраница() Цикл
			Результат[Индекс] = -Результат[Индекс]; 
		КонецЦикла;		
	КонецЕсли;
	Возврат Результат;
КонецФункции

&НаКлиенте
Процедура КомандаРаспределить(Команда)
	Коэффициенты = Новый Массив;
//	Коэффициенты.Добавить(0.01);
	Для й = 1 По 3000 Цикл
		Коэффициенты.Добавить(-1);
	КонецЦикла;
//	Коэффициенты.Добавить(0.03);
//	Коэффициенты.Добавить(1);
//	Коэффициенты.Добавить(1);
	//Коэффициенты = ОбщийКлиентСервер.JSONВОбъект("[0.33, 0.34, 0.32, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.34, 0.34, 0.34, 0.34, 0.34, 0.34, 0.34, 0.34, 0.33, 0.33, 0.33, 0.33, 0.34, 0.34, 0.33]");	
	//Коэффициенты = ОбщийКлиентСервер.JSONВОбъект("[0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.34, 0.33, 0.34, 0.33, 0.34, 0.33, 0.34, 0.33, 0.34, 0.33, 0.34, 0.33, 0.34, 0.33, 0.34, 0.33, 0.34, 0.33, 0.34, 0.33]");
	//Коэффициенты = ОбщийКлиентСервер.JSONВОбъект("[0.43, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33, 0.33]");
	ДатаВремяНачала = ТекущаяУниверсальнаяДатаВМиллисекундах();
	//Результат = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(10, Коэффициенты, 2);
	//Результат = РаспределитьСумму(10, Коэффициенты, 2);
	//Коэффициенты = ОбщийКлиентСервер.JSONВОбъект("[-1, -1, -1]");
	Результат = РаспределитьСумму(-1000, Коэффициенты, 2);
	//Результат = ОбщегоНазначенияКлиентСервер.РаспределитьСуммуПропорциональноКоэффициентам(-3, Коэффициенты, 2);	
	//Результат = РаспределитьПоЭффективномуОстатку(100, Коэффициенты, 2);
	//Результат = РаспределитьСПересчетомБазыРаспределения(100, Коэффициенты, 2);
	//Результат = РаспределитьСВерхнимПределом(991, Коэффициенты, 2);
	ДатаВремяОкончания = ТекущаяУниверсальнаяДатаВМиллисекундах();
	Сообщить("Время: " + (ДатаВремяОкончания - ДатаВремяНачала));
	Итог = 0;
	Для й = 0 По Коэффициенты.ВГраница() Цикл
		Если Коэффициенты[й] < Результат[й] Тогда
			Сообщить("Превышение по индексу: " + й);
		КонецЕсли;
		Итог = Итог + Результат[й];
	КонецЦикла;
	Сообщить("Итог: " + Итог);
	Сообщить(ОбщийКлиентСервер.ОбъектВJSON(Результат));
КонецПроцедуры
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	ДобавитьСтруктуруТаблицы("Таблица");
	ДобавитьСтруктуруТаблицы("Отношение");
	ДобавитьСтруктуруТаблицы("База");
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ДобавитьСтруктуруТаблицы(Роль)
	Таблицы = СтруктураМодели.ПолучитьЭлементы();
	Таблица = Таблицы.Добавить();
	Таблица.Роль = Роль;
	Если Роль = "Отношение" Тогда
		Секции = Таблица.ПолучитьЭлементы();
		Секция = Секции.Добавить();
		Секция.Роль = "ИзмеренияТаблицы";
		Секция = Секции.Добавить();
		Секция.Роль = "ИзмеренияБазы";
		Секция = Секции.Добавить();
		Секция.Роль = "Ресурсы";
		Возврат;
	КонецЕсли;
	Секции = Таблица.ПолучитьЭлементы();
	Секция = Секции.Добавить();
	Секция.Роль = "Измерения";
	Секция = Секции.Добавить();
	Секция.Роль = "Ресурсы";
	Секция = Секции.Добавить();
	Секция.Роль = "Реквизиты";
КонецПроцедуры

#КонецОбласти
